In [2]:
import pandas as pd
import numpy as np

# Series

In [3]:
labels = ['a','b','c']
data = [10,20,30]
arr = np.array(data)
d={'a':10,'b':20,'c':30}

In [4]:
pd.Series(data,labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(labels,data)

10    a
20    b
30    c
dtype: object

In [6]:
pd.Series(data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series([1,2,3,4],['Jay','Nila','S','D'])

Jay     1
Nila    2
S       3
D       4
dtype: int64

# Data Frames

In [11]:
from numpy.random import randn

In [12]:
np.random.seed(101)

In [15]:
df = pd.DataFrame(randn(4,4),['a','b','c','d'],['x','y','z','j'])
df

          x         y         z         j
a -0.116773  1.901755  0.238127  1.996652
b -0.993263  0.196800 -1.136645  0.000366
c  1.025984 -0.156598 -0.031579  0.649826
d  2.154846 -0.610259 -0.755325 -0.346419

In [18]:
df['x']

a   -0.116773
b   -0.993263
c    1.025984
d    2.154846
Name: x, dtype: float64

In [19]:
type(df['x'])

pandas.core.series.Series

In [20]:
df.x

a   -0.116773
b   -0.993263
c    1.025984
d    2.154846
Name: x, dtype: float64

In [22]:
df[['x','y']]

          x         y
a -0.116773  1.901755
b -0.993263  0.196800
c  1.025984 -0.156598
d  2.154846 -0.610259

In [25]:
df['new'] = df['x'] + df['y']
df['new']

a    1.784981
b   -0.796464
c    0.869386
d    1.544588
Name: new, dtype: float64

In [26]:
df

          x         y         z         j       new
a -0.116773  1.901755  0.238127  1.996652  1.784981
b -0.993263  0.196800 -1.136645  0.000366 -0.796464
c  1.025984 -0.156598 -0.031579  0.649826  0.869386
d  2.154846 -0.610259 -0.755325 -0.346419  1.544588

to cut out a colounm out of the data

In [29]:
df.drop('new',axis=1)

          x         y         z         j
a -0.116773  1.901755  0.238127  1.996652
b -0.993263  0.196800 -1.136645  0.000366
c  1.025984 -0.156598 -0.031579  0.649826
d  2.154846 -0.610259 -0.755325 -0.346419

In [30]:
df

          x         y         z         j       new
a -0.116773  1.901755  0.238127  1.996652  1.784981
b -0.993263  0.196800 -1.136645  0.000366 -0.796464
c  1.025984 -0.156598 -0.031579  0.649826  0.869386
d  2.154846 -0.610259 -0.755325 -0.346419  1.544588

In [32]:
df.drop('new',axis=1,inplace=True)

In [33]:
df

          x         y         z         j
a -0.116773  1.901755  0.238127  1.996652
b -0.993263  0.196800 -1.136645  0.000366
c  1.025984 -0.156598 -0.031579  0.649826
d  2.154846 -0.610259 -0.755325 -0.346419

For Rows

In [36]:
df.drop('d',inplace=True)

In [37]:
df

          x         y         z         j
a -0.116773  1.901755  0.238127  1.996652
b -0.993263  0.196800 -1.136645  0.000366
c  1.025984 -0.156598 -0.031579  0.649826

In [38]:
df.shape

(3, 4)

Rows

In [39]:
df.loc['a']

x   -0.116773
y    1.901755
z    0.238127
j    1.996652
Name: a, dtype: float64

In [44]:
df.iloc[0]

x   -0.116773
y    1.901755
z    0.238127
j    1.996652
Name: a, dtype: float64

For Single Value